# General

tap 'homebrew/bundle'
tap 'caskroom/cask'
tap 'homebrew/cask-fonts'
tap 'buo/cask-upgrade'
tap 'wagoodman/dive'

# Casks

cask 'dropbox'
cask '1Password'
cask 'authy'
cask 'viscosity'
cask 'keybase'

cask 'firefox'
cask 'google-chrome'

cask 'veracrypt'

cask 'slack'
cask 'skype'
cask 'whatsapp'
cask 'telegram'
cask 'gitter'
cask 'zulip'

cask 'visual-studio-code'
cask 'sourcetree'
cask 'iterm2'

cask 'docker'
cask 'virtualbox'
cask 'virtualbox-extension-pack'

cask 'transmission'
cask 'coconutbattery'
cask 'disk-inventory-x'
cask 'appcleaner'
cask 'the-unarchiver'
cask 'keepingyouawake'
cask 'onyx'

cask 'spotify'
cask 'vlc'

cask 'mactex'
cask 'skim'
cask 'adobe-acrobat-reader'

# Fonts

cask 'font-inconsolata'
cask 'font-roboto'
cask 'font-roboto-condensed'
cask 'font-roboto-mono'
cask 'font-roboto-slab'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-open-sans'
cask 'font-open-sans-condensed'
cask 'font-pt-mono'
cask 'font-pt-sans'
cask 'font-pt-serif'
cask 'font-ubuntu'
cask 'font-yanone-kaffeesatz'
cask 'font-noto-sans'
cask 'font-noto-emoji'
cask 'font-noto-color-emoji'
cask 'font-noto-serif'
cask 'font-fira-code'
cask 'font-hasklig'
cask 'font-montserrat'
cask 'font-fontawesome'
cask 'font-ibm-plex'
cask 'font-cousine'
cask 'font-handlee'
cask 'font-redhat'
cask 'font-cascadia'
cask 'font-jetbrains-mono'

# Brews

brew 'bash'
brew 'bash-completion'

brew 'zsh'
brew 'zsh-completion'
brew 'fzf'
brew 'tmux'

brew 'vim'
brew 'nano'
brew 'aspell'

brew 'curl'
brew 'wget'
brew 'rsync'
brew 'httpie'
brew 'hostess'

brew 'awscli'
brew 'imapsync'

brew 'binutils'
brew 'coreutils'
brew 'moreutils'
brew 'openssl'

brew 'stow'
brew 'tree'
brew 'pstree'
brew 'bat'
brew 'watchexec'
brew 'htop'
brew 'fd'
brew 'noti'
brew 'the_silver_searcher'

brew 'p7zip'
brew 'unrar'
brew 'xz'

brew 'imagemagick'
brew 'pandoc'

brew 'lame'
brew 'flac'

brew 'dive'
brew 'kube-ps1'
brew 'kubectl'
brew 'forego'

brew 'ccache'
brew 'git'
brew 'git-extras'
brew 'hub'
brew 'mercurial'

brew 'gnupg2'
brew 'pinentry-mac'

brew 'ant'
brew 'maven'
brew 'gradle'
brew 'yarn'

brew 'go'
brew 'golo'
brew 'node'
brew 'python'
brew 'rbenv'
brew 'ruby-build'

brew 'gnuplot'
brew 'graphviz'
brew 'plantuml'
