# General

cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'caskroom/cask'
tap 'homebrew/versions'
tap 'homebrew/dupes'
tap 'homebrew/python'
tap 'caskroom/fonts'
tap 'buo/cask-upgrade'

# Casks

cask 'dropbox'
cask '1Password'

cask 'firefox'
cask 'thunderbird'
cask 'google-chrome'

cask 'veracrypt'

cask 'slack'
cask 'skype'
cask 'whatsapp'
cask 'telegram-desktop'
cask 'gitter'

cask 'visual-studio-code'
cask 'macvim'
cask 'iterm2'

cask 'jabba'

cask 'docker'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'wireshark'

cask 'transmission'
cask 'coconutbattery'
cask 'disk-inventory-x'
cask 'duet'
cask 'appcleaner'
cask 'the-unarchiver'
cask 'keepingyouawake'
cask 'onyx'

cask 'spotify'
cask 'beatport-pro'
cask 'vlc'

cask 'mactex'
cask 'skim'
cask 'yed'
cask 'libreoffice'

# cask 'google-nik-collection'

# Fonts

cask 'caskroom/fonts/font-inconsolata'
cask 'caskroom/fonts/font-roboto'
cask 'caskroom/fonts/font-roboto-condensed'
cask 'caskroom/fonts/font-roboto-mono'
cask 'caskroom/fonts/font-roboto-slab'
cask 'caskroom/fonts/font-signika'
cask 'caskroom/fonts/font-signika-negative'
cask 'caskroom/fonts/font-source-code-pro'
cask 'caskroom/fonts/font-source-sans-pro'
cask 'caskroom/fonts/font-source-serif-pro'
cask 'caskroom/fonts/font-open-sans'
cask 'caskroom/fonts/font-open-sans-condensed'
cask 'caskroom/fonts/font-pt-mono'
cask 'caskroom/fonts/font-pt-sans'
cask 'caskroom/fonts/font-pt-serif'
cask 'caskroom/fonts/font-ubuntu'
cask 'caskroom/fonts/font-yanone-kaffeesatz'
cask 'caskroom/fonts/font-noto-sans'
cask 'caskroom/fonts/font-noto-emoji'
cask 'caskroom/fonts/font-noto-color-emoji'
cask 'caskroom/fonts/font-noto-serif'
cask 'caskroom/fonts/font-fira-code'
cask 'caskroom/fonts/font-hasklig'
cask 'caskroom/fonts/font-montserrat'
cask 'caskroom/fonts/font-fontawesome'

# Brews

brew 'bash'
brew 'bash-completion'

brew 'zsh'
brew 'zsh-completion'
brew 'fzf'

brew 'vim'
brew 'nano'
brew 'aspell', args: ['with-lang-fr', 'with-lang-en']

brew 'curl'
brew 'wget'
brew 'rsync'
brew 'httpie'
brew 'awscli'
brew 'imapsync'

brew 'binutils'
brew 'coreutils'
brew 'moreutils'
brew 'openssl'

brew 'stow'
brew 'tree'
brew 'pstree'
brew 'p7zip'
brew 'unrar'
brew 'imagemagick'
brew 'lame'
brew 'flac'
brew 'xz'
brew 'pandoc'

brew 'ccache'
brew 'git'
brew 'git-extras'
brew 'mercurial'

brew 'gnupg2'
brew 'certbot'

brew 'ant'
brew 'maven'
brew 'gradle'
brew 'yarn'

brew 'go'
brew 'golo'
brew 'groovy'
brew 'scala'
brew 'node'
brew 'python'
brew 'python3'
brew 'kotlin'
brew 'rbenv'
brew 'ruby-build'

brew 'vert.x'

brew 'gnuplot'
brew 'graphviz'
brew 'matplotlib'

brew 'docbook'
brew 'docbook-xsl'
