# Taps

tap "buo/cask-upgrade"
tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "jabley/wrk2"
tap "jbangdev/tap"

# Brews

brew "act"
brew "ant"
brew "xz"
brew "asciidoc"
brew "aspell"
brew "awscli"
brew "bandwhich"
brew "bash"
brew "bash-completion"
brew "bat"
brew "binutils"
brew "ccache"
brew "chkrootkit"
brew "coreutils"
brew "libev"
brew "curl"
brew "exa"
brew "fd"
brew "flac"
brew "lame"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git"
brew "git-extras"
brew "gnupg"
brew "gnuplot"
brew "go"
brew "golo"
brew "gradle"
brew "graphviz"
brew "hey"
brew "hivemind"
brew "hostess"
brew "htop"
brew "duf"
brew "httpie"
brew "imagemagick"
brew "imapsync"
brew "jq"
brew "kind"
brew "mas"
brew "maven"
brew "mercurial"
brew "minikube"
brew "moreutils"
brew "nano"
brew "neovim"
brew "netcat"
brew "node"
brew "noti"
brew "openshift-cli"
brew "p7zip"
brew "pandoc"
brew "pinentry-mac"
brew "plantuml"
brew "pstree"
brew "pumba"
brew "pyenv"
brew "ruby-build"
brew "rbenv"
brew "rsync"
brew "skaffold"
brew "stow"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "unrar"
brew "vegeta"
brew "vim"
brew "watch"
brew "watchexec"
brew "websocat"
brew "wget"
brew "wrk"
brew "yarn"
brew "youtube-dl"
brew "zsh"
brew "zsh-completions"
brew "derailed/k9s/k9s"
brew "dive"

# Casks

cask "1password"
cask "adobe-acrobat-reader"
cask "appcleaner"
cask "authy"
cask "blue-jeans"
cask "brave-browser"
cask "coconutbattery"
cask "discord"
cask "disk-inventory-x"
cask "dropbox"
cask "google-chrome"
cask "grammarly"
cask "handbrake"
cask "iterm2"
cask "jdk-mission-control"
cask "keepingyouawake"
cask "keybase"
cask "mactex-no-gui"
cask "microsoft-teams"
cask "obs"
cask "onyx"
cask "rectangle"
cask "signal"
cask "skim"
cask "skype"
cask "slack"
cask "sourcetree"
cask "telegram-desktop"
cask "the-unarchiver"
cask "transmission"
cask "veracrypt"
cask "viscosity"
cask "visual-studio-code"
cask "vlc"
cask "zoom"
cask "zulip"

# Fonts

cask "font-cascadia"
cask "font-cousine"
cask "font-fira-code"
cask "font-fontawesome"
cask "font-handlee"
cask "font-hasklig"
cask "font-ibm-plex"
cask "font-inconsolata"
cask "font-jetbrains-mono"
cask "font-jetbrainsmono-nerd-font"
cask "font-jetbrainsmono-nerd-font-mono"
cask "font-linux-libertine"
cask "font-montserrat"
cask "font-noto-color-emoji"
cask "font-noto-emoji"
cask "font-noto-sans"
cask "font-noto-serif"
cask "font-open-sans"
cask "font-open-sans-condensed"
cask "font-pt-mono"
cask "font-pt-sans"
cask "font-pt-serif"
cask "font-redhat"
cask "font-roboto"
cask "font-roboto-condensed"
cask "font-roboto-mono"
cask "font-roboto-slab"
cask "font-signika-negative"
cask "font-source-code-pro"
cask "font-source-sans-pro"
cask "font-source-serif-pro"
cask "font-ubuntu"
cask "font-yanone-kaffeesatz"

# MAS

mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Todoist", id: 585829637
